Repository: renoir01/SmartInventory
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: rw

source: Invalid username or password
rw: Izina ry'ukoresha cyangwa ijambo ry'ibanga biratari byo

source: Access denied. Admin privileges required.
rw: Ntibyemewe. Uburenganzira bw'umuyobozi bukenewe.

source: Access denied. Cashier privileges required.
rw: Ntibyemewe. Uburenganzira bw'umucuruzi bukenewe.

source: Product added successfully!
rw: Igicuruzwa cyongewe neza!

source: Product updated successfully!
rw: Igicuruzwa kivuguruwe neza!

source: Cannot delete product "{0}" because it has associated sales records. Consider updating the product instead.
rw: Ntushobora gusiba igicuruzwa "{0}" kuko gifite inyandiko z'ubucuruzi. Tekereza guhindura igicuruzwa aho kugisiba.

source: Product deleted successfully!
rw: Igicuruzwa gisibwe neza!

source: Not enough stock available. Only {0} units left.
rw: Nta bicuruzwa bihagije bihari. Hasigaye gusa {0}.

source: Sale recorded successfully!
rw: Ubucuruzi bwanditswe neza!

source: Database initialized with admin and cashier users.
rw: Ububiko bw'amakuru bwatangijwe n'abakoresha b'umuyobozi n'umucuruzi.

source: Smart Inventory
rw: Ububiko Bwiza

source: Dashboard
rw: Ikibaho

source: Products
rw: Ibicuruzwa

source: Sales
rw: Ubucuruzi

source: My Sales
rw: Ubucuruzi Bwanjye

source: Logout
rw: Sohoka

source: Admin Dashboard
rw: Ikibaho cy'Umuyobozi

source: Overview of your inventory and sales
rw: Incamake y'ububiko n'ubucuruzi bwawe

source: Total Products
rw: Ibicuruzwa Byose

source: Total products in inventory
rw: Ibicuruzwa byose mu bubiko

source: View all products
rw: Reba ibicuruzwa byose

source: Low Stock Items
rw: Ibicuruzwa Bike

source: Products that need restocking
rw: Ibicuruzwa bikeneye kongerwamo

source: View details
rw: Reba ibisobanuro

source: Today's Sales
rw: Ubucuruzi bw'Uyu Munsi

source: Total sales made today
rw: Ubucuruzi bwose bwakozwe uyu munsi

source: View all sales
rw: Reba ubucuruzi bwose

source: Today's Revenue
rw: Amafaranga y'Uyu Munsi

source: Total revenue generated today
rw: Amafaranga yose yakusanyijwe uyu munsi

source: View sales report
rw: Reba raporo y'ubucuruzi

source: Today's Profit
rw: Inyungu y'Uyu Munsi

source: Total profit generated today
rw: Inyungu yose yakusanyijwe uyu munsi

source: View profit report
rw: Reba raporo y'inyungu

source: Low Stock Products
rw: Ibicuruzwa Bike

source: Category
rw: Icyiciro

source: Current Stock
rw: Ububiko Bwubu

source: Threshold
rw: Urugero

source: Action
rw: Igikorwa

source: Update
rw: Kuvugurura

source: All products are well stocked!
rw: Ibicuruzwa byose bihari bihagije!

source: Inventory by Category
rw: Ububiko Bwakurikije Icyiciro

source: Quick Actions
rw: Ibikorwa Byihuse

source: Add New Product
rw: Ongeramo Igicuruzwa Gishya

source: View Sales Report
rw: Reba Raporo y'Ubucuruzi

source: Manage Products
rw: Gucunga Ibicuruzwa

source: English
rw: Icyongereza

source: Kinyarwanda
rw: Ikinyarwanda

source: Efficient inventory and sales management for your mini market business.
rw: Gucunga neza ububiko n'ubucuruzi bw'isoko ryawe rito.

source: Quick Links
rw: Amahuriro Yihuse

source: Home
rw: Ahabanza

source: Language
rw: Ururimi

source: 2025 Smart Inventory. All rights reserved.
rw: 2025 Ububiko Bwiza. Uburenganzira bwose bwihariwe.

source: Cashier Dashboard
rw: Ikibaho cy'Umucuruzi

source: Sales you've made today
rw: Ubucuruzi wakoze uyu munsi

source: Revenue you've generated today
rw: Amafaranga winjije uyu munsi

source: Record New Sale
rw: Andika Ubucuruzi Bushya

source: Select Product
rw: Hitamo Igicuruzwa

source: -- Select a product --
rw: -- Hitamo igicuruzwa --

source: in stock
rw: mu bubiko

source: Quantity
rw: Ingano

source: Record Sale
rw: Andika Ubucuruzi

source: Time
rw: Igihe

source: Product
rw: Igicuruzwa

source: Price
rw: Igiciro

source: Purchase Price
rw: Igiciro cyo Kugura

source: Selling Price
rw: Igiciro cyo Kugurisha

source: The price at which you purchased this product
rw: Igiciro waguriyeho iki gicuruzwa

source: The price at which you will sell this product
rw: Igiciro uzagurisha iki gicuruzwa

source: Profit Margin
rw: Inyungu ku Ijana

source: You haven't recorded any sales today.
rw: Ntabwo wanditse ubucuruzi uyu munsi.

source: View All My Sales
rw: Reba Ubucuruzi Bwanjye Bwose

source: My Sales History
rw: Amateka y'Ubucuruzi Bwanjye

source: From Date
rw: Kuva Itariki

source: To Date
rw: Kugera Itariki

source: All Categories
rw: Ibyiciro Byose

source: Filter
rw: Shaka

source: Reset
rw: Tangira Bushya

source: Total Revenue
rw: Amafaranga Yose

source: Total revenue for selected period
rw: Amafaranga yose mu gihe cyahisemo

source: Total Profit
rw: Inyungu Yose

source: Total profit for selected period
rw: Inyungu yose mu gihe cyahisemo

source: Sales by Category
rw: Ubucuruzi Bwakurikije Icyiciro

source: Total Items
rw: Ibintu Byose

source: Revenue
rw: Amafaranga

source: Profit
rw: Inyungu

source: Detailed Sales
rw: Ubucuruzi Burambuye

source: Date & Time
rw: Itariki & Igihe

source: No sales found for the selected criteria.
rw: Nta bucuruzi bwabonetse ku byo wahisemo.

source: Total
rw: Igiteranyo

source: Actions
rw: Ibikorwa

source: Delete
rw: Siba

source: Are you sure you want to delete this sale? This will restore the stock to the product.
rw: Urashaka koko gusiba ubu bucuruzi? Ibi bizongerera igicuruzwa mu bubiko.

source: Sale of %(quantity)d %(product)s by %(cashier)s on %(date)s has been deleted and stock has been restored.
rw: Ubucuruzi bwa %(quantity)d %(product)s bwakozwe na %(cashier)s ku wa %(date)s bwasibwe kandi igicuruzwa cyasubijwe mu bubiko.
